import streamlit as st
import pandas as pd
import numpy as np
"""
# 第一章　
始めに
Streamlitは、Pythonで作成されたフレームワークで、データの可視化や機械学習モデルのプロトタイプ作成などを簡単に行えるツールです。コードを書くだけで、ウェブアプリケーションを作成できます。データの表示や操作、インタラクティブ（マウスやキーボードを用いて操作）なコントロールの作成が容易であり、データサイエンティストや開発者にとって便利なツールです。
## 節
1.リアルタイムなコードの実行と自動的なアップデート：コードを編集するたびに、ウェブアプリケーションが自動的にアップデートされます。
## 2.
シンプルなコマンドでのデータの表示：データフレームやグラフなどのデータを簡単に表示できます。
## 3.
インタラクティブなウィジェットの作成：ユーザーがウェブアプリケーション上でスライダーやチェックボックスなどのコントロールを操作できるようにします。
## 4.
プロトタイピングの容易さ：データの可視化やモデルのプロトタイプ作成などを迅速に行うことができます。

### 項
 最初のコード
 ```
 streamlit --version
 ```
 で確認してこのコマンドをターミナルやコマンドプロンプトで実行すると、インストールされているStreamlitのバージョン情報が表示されます。もし正しくインストールされていれば、バージョン番号が表示されます。
 もしStreamlitがインストールされていない場合は、以下のコマンドを使用してインストールすることができます。
 ```
 pip3 install streamlit
 ```
 モジュールをインポート
```python
import streamlit as st
import numpy as np
import pandas as pd
```
文字を表示  
```
st.title("title") # タイトル
st.header("header") # ヘッダー
st.write("write") # 表示
st.markdown("# markdown") # マークダウンで表示
st.text("text") # テキスト表示
# 章
## 節
### 項
```
ダブルコーテーションを3つで囲むとMarkdown記法使える、また
バックコーテーションを３つで囲むとコードを表記させる事ができる
# """